In [2]:
import pandas as pd

In [7]:
df_movies = pd.read_csv(r'D:\Data Science\SampleDocuments\IMDb movies.csv',low_memory=False)

In [9]:
df_ratings = pd.read_csv(r'D:\Data Science\SampleDocuments\IMDb ratings.csv',low_memory=False)

In [10]:
df_movies.columns

Index(['imdb_title_id', 'title', 'original_title', 'year', 'date_published',
       'genre', 'duration', 'country', 'language', 'director', 'writer',
       'production_company', 'actors', 'description', 'avg_vote', 'votes',
       'budget', 'usa_gross_income', 'worlwide_gross_income', 'metascore',
       'reviews_from_users', 'reviews_from_critics'],
      dtype='object')

In [11]:
df_movies = df_movies[['imdb_title_id','title','year','genre','country']]
df_ratings = df_ratings[['imdb_title_id','total_votes','mean_vote']]

# Concatenate()
1. Vertical

In [14]:
df1 = pd.DataFrame({'id': ['A', 'B', 'C', 'D'],
                    'age': [30, 23, 25, 22]})
df2 = pd.DataFrame({'id': ['E', 'F', 'G', 'F'],
                    'age': [40, 21, 19, 24]})

In [16]:
#COncatenating
pd.concat([df1,df2],axis = 0,ignore_index = True)

  id  age
0  A   30
1  B   23
2  C   25
3  D   22
4  E   40
5  F   21
6  G   19
7  F   24

In [25]:
# extract 50% sample of the original dataframe
df_sample = df_movies.sample(frac=.5,random_state=1)

In [26]:
# shape od DFs we concatenate
df_sample.shape,df_movies.shape

((42928, 5), (85855, 5))

In [28]:
# concatenatnating df_sample and df_movies
df_concat = pd.concat([df_movies,df_sample],axis = 0)

In [29]:
# shape
df_concat.shape

(128783, 5)

### Concatenating horizontly

In [30]:
df1 = pd.DataFrame({'id': ['A', 'B', 'C', 'D'],
                    'age': [30, 23, 25, 22]})
df2 = pd.DataFrame({'job': ['Doctor', 'Statistician',
                            'Accountant', 'Developer']})

In [31]:
pd.concat([df1,df2],axis=1)

  id  age           job
0  A   30        Doctor
1  B   23  Statistician
2  C   25    Accountant
3  D   22     Developer

In [32]:
# shapes of dataframes that well concatenate
df_movies.shape,df_ratings.shape

((85855, 5), (85855, 3))

In [34]:
df_movies.set_index('imdb_title_id',inplace=True)
df_ratings.set_index('imdb_title_id',inplace=True)

In [36]:
# concatenating on imdb_title_id
df_imdb = pd.concat([df_movies,df_ratings],axis=1,)

In [37]:
df_imdb.shape

(85855, 6)

# .merge()

In [38]:
df1 = pd.DataFrame({'id': ['A', 'B', 'C', 'D'],
                    'age': [30, 23, 25, 22]})
df2 = pd.DataFrame({'id': ['C', 'D', 'E', 'F'],
                    'job': ['Doctor', 'Statistician',
                            'Accountant', 'Developer']})

In [40]:
df1

  id  age
0  A   30
1  B   23
2  C   25
3  D   22

In [41]:
df2

  id           job
0  C        Doctor
1  D  Statistician
2  E    Accountant
3  F     Developer

In [47]:
# inner join
df_inner_join = df1.merge(df2,on='id',how='inner')

In [48]:
df1.shape,df2.shape,df_inner_join.shape

((4, 2), (4, 2), (2, 3))

In [50]:
# merge of df_movies and df_ratings
df_movies.merge(df_ratings,on='imdb_title_id',how='inner')

,title,year,genre,country,total_votes,mean_vote
imdb_title_id,,,,,,
tt0000009,Miss Jerry,1894,Romance,USA,154,5.9
tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,589,6.3
tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark",188,6.0
tt0002101,Cleopatra,1912,"Drama, History",USA,446,5.3
tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,2237,6.9
...,...,...,...,...,...,...
tt9908390,Le lion,2020,Comedy,"France, Belgium",398,5.5
tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands,724,7.9
tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India,265,7.8
tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey,194,9.4
tt9914942,La vida sense la Sara Amat,2019,Drama,Spain,102,6.8